In [1]:
#6 Add/Remove Rows and Columns from DataFrames

In [57]:
people = {
    "first": ["Gonzalo", "Jane", "Joe"],
    "last": ["Rivero", "Doe", "Doe"],
    "email": ["burrito@gmail.com", 'janedoe@email.com', "johndoe@email.com"]
}

In [58]:
import pandas as pd

In [59]:
df = pd.DataFrame(people)

In [60]:
df

     first    last              email
0  Gonzalo  Rivero  burrito@gmail.com
1     Jane     Doe  janedoe@email.com
2      Joe     Doe  johndoe@email.com

In [61]:
df['first'] + ' ' + df['last']  #this is a Series

0    Gonzalo Rivero
1          Jane Doe
2           Joe Doe
dtype: object

In [62]:
df['full_name'] = df['first'] + ' ' + df['last']

In [63]:
df

     first    last              email       full_name
0  Gonzalo  Rivero  burrito@gmail.com  Gonzalo Rivero
1     Jane     Doe  janedoe@email.com        Jane Doe
2      Joe     Doe  johndoe@email.com         Joe Doe

In [64]:
df.drop(columns=['first', 'last'], inplace=True)

In [65]:
df

               email       full_name
0  burrito@gmail.com  Gonzalo Rivero
1  janedoe@email.com        Jane Doe
2  johndoe@email.com         Joe Doe

In [66]:
df['full_name'].str.split(' ')

0    [Gonzalo, Rivero]
1          [Jane, Doe]
2           [Joe, Doe]
Name: full_name, dtype: object

In [67]:
df['full_name'].str.split(' ', expand=True)

         0       1
0  Gonzalo  Rivero
1     Jane     Doe
2      Joe     Doe

In [68]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)

In [69]:
df

               email       full_name    first    last
0  burrito@gmail.com  Gonzalo Rivero  Gonzalo  Rivero
1  janedoe@email.com        Jane Doe     Jane     Doe
2  johndoe@email.com         Joe Doe      Joe     Doe

In [71]:
df.append({'first': 'Tony'}, ignore_index=True)

               email       full_name    first    last
0  burrito@gmail.com  Gonzalo Rivero  Gonzalo  Rivero
1  janedoe@email.com        Jane Doe     Jane     Doe
2  johndoe@email.com         Joe Doe      Joe     Doe
3                NaN             NaN     Tony     NaN

In [77]:
people2 = {
    "first": ["Tony", "Steve"],
    "last": ["Stark", "Ouuu"],
    "email": ['ironman@avenger.com', "steveo@jackass.com"]
}

In [78]:
df2 = pd.DataFrame(people2)

In [79]:
df2

   first   last                email
0   Tony  Stark  ironman@avenger.com
1  Steve   Ouuu   steveo@jackass.com

In [80]:
df.append(df2, ignore_index=True)

                 email       full_name    first    last
0    burrito@gmail.com  Gonzalo Rivero  Gonzalo  Rivero
1    janedoe@email.com        Jane Doe     Jane     Doe
2    johndoe@email.com         Joe Doe      Joe     Doe
3  ironman@avenger.com             NaN     Tony   Stark
4   steveo@jackass.com             NaN    Steve    Ouuu

In [81]:
df = df.append(df2, ignore_index=True)

In [82]:
df

                 email       full_name    first    last
0    burrito@gmail.com  Gonzalo Rivero  Gonzalo  Rivero
1    janedoe@email.com        Jane Doe     Jane     Doe
2    johndoe@email.com         Joe Doe      Joe     Doe
3  ironman@avenger.com             NaN     Tony   Stark
4   steveo@jackass.com             NaN    Steve    Ouuu

In [85]:
df.drop(4, inplace=True)

In [86]:
df

                 email       full_name    first    last
0    burrito@gmail.com  Gonzalo Rivero  Gonzalo  Rivero
1    janedoe@email.com        Jane Doe     Jane     Doe
2    johndoe@email.com         Joe Doe      Joe     Doe
3  ironman@avenger.com             NaN     Tony   Stark

In [ ]:
df.drop(index=df['last'] == 'Doe')